#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/aws_deepdive/kubernetes-ops-staging-25-eks-cluster-autoscaler/runs/run-W6RfA9tnQ4p4NQT1

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.eks: Reading...
data.terraform_remote_state.eks: Read complete after 0s
module.cluster-autoscaler.module.iam_assumable_role_admin.data.aws_partition.current: Reading...
module.cluster-autoscaler.data.aws_caller_identity.current: Reading...
module.cluster-autoscaler.module.iam_assumable_role_admin.data.aws_caller_identity.current: Reading...
module.cluster-autoscaler.data.aws_iam_policy_document.cluster_autoscaler: Reading...
module.cluster-autoscaler.module.iam_assumable_role_admin.data.aws_partition.current: Read complete after 0s [id=aws]
module.cluster-autoscaler.data.aws_iam_policy_document.cluster_autoscaler: Read complete after 0s [id=3248901210]
module.cluster-autoscaler.aws_iam_policy.cluster_autoscaler: Refreshing state... [id=arn:aws:iam::091086670112:policy/cluster-autoscaler-staging20230722140240624100000001]
module.cluster-autoscaler.module.iam_assumable_role_admin.data.aws_caller_identity.current: Read complete after 0s [id=091086670112]
module.cluster-autoscaler.data.aws_caller_identity.current: Read complete after 0s [id=091086670112]
module.cluster-autoscaler.module.iam_assumable_role_admin.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.cluster-autoscaler.data.template_file.helm_values: Reading...
module.cluster-autoscaler.data.template_file.helm_values: Read complete after 0s [id=1c374a2bc3e5fab5ae1601b174f1e5cf7400efc4cd94d40bef063bf9a02e8781]
module.cluster-autoscaler.module.iam_assumable_role_admin.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=3238922165]
module.cluster-autoscaler.module.iam_assumable_role_admin.aws_iam_role.this[0]: Refreshing state... [id=cluster-autoscaler-staging]
module.cluster-autoscaler.module.iam_assumable_role_admin.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=cluster-autoscaler-staging-20230722140240814000000002]
module.cluster-autoscaler.helm_release.cluster_autoscaler: Refreshing state... [id=cluster-autoscaler]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cluster-autoscaler.helm_release.cluster_autoscaler will be created
  + resource "helm_release" "cluster_autoscaler" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                awsRegion: us-east-1
                
                rbac:
                  create: true
                  serviceAccount:
                    # This value should match local.k8s_service_account_name in locals.tf
                    name: cluster-autoscaler-aws-cluster-autoscaler
                    annotations:
                      # This value should match the ARN of the role created by module.iam_assumable_role_admin in irsa.tf
                      eks.amazonaws.com/role-arn: "arn:aws:iam::091086670112:role/cluster-autoscaler-staging"
                
                autoDiscovery:
                  clusterName: staging
                  enabled: true
            EOT,
        ]
      + verify                     = false
      + version                    = "9.29.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.cluster-autoscaler.module.iam_assumable_role_admin.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/BBFE5FE0EAC5EA8C756A6E80CA53531F:sub" = "system:serviceaccount:kube-system:cluster-autoscaler-aws-cluster-autoscaler"
                              + "oidc.eks.us-east-1.amazonaws.com/id/D9D92DD88387727F93F2E06C69BEF2AC:sub" = "system:serviceaccount:kube-system:cluster-autoscaler-aws-cluster-autoscaler"
                            }
                        }
                      ~ Principal = {
                          ~ Federated = "arn:aws:iam::091086670112:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/BBFE5FE0EAC5EA8C756A6E80CA53531F" -> "arn:aws:iam::091086670112:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/D9D92DD88387727F93F2E06C69BEF2AC"
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "cluster-autoscaler-staging"
        name                  = "cluster-autoscaler-staging"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```


</details>

*Pusher: @anhtuanit93, Action: `pull_request`*